#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <stdlib.h>
#include <stdio.h>

#define қазақшасөйле setlocale(LC_ALL, "kk_kz.UTF-8")
#define басты main
#define қайт return
#define аш {
#define жап }
#define егер if
#define әйтпесе else
#define болғанша while
#define үшін for
#define кетбар break
#define өтіпкет continue
#define секір goto
#define және &&
#define әлде ||
#define жә &
#define әл |
#define я ^
#define жаз printf
#define жжаз sprintf
#define фжаз fprintf
#define оқы scanf
#define фоқы fscanf
#define жоқы sscanf
#define тең =
#define теңтең ==
#define үлкен >
#define үтең >=
#define кіші <
#define ктең <=
#define қосу +
#define алу -
#define көбу *
#define бөлу /
#define қостең +=
#define алтең -=
#define көбтең *=
#define бөлтең /=
#define арттыр ++
#define азайт --
#define қалдық %
#define жаңажол "\n"
#define ондықПішім "%d"
#define жолПішім "%s"

#define нөл 0
#define бір 1
#define екі 2
#define үш 3
#define төрт 4
#define бес 5
#define алты 6
#define жеті 7
#define сегіз 8
#define тоғыз 9
#define он 10
#define жиырма 20
#define отыз 30
#define қырық 40
#define елу 50
#define алпыс 60
#define жетпіс 70
#define сексен 80
#define тоқсан 90
#define жүз 100
#define мың 1000
#define миллион 1000000
#define миллиард 1000000000
#define шын бір
#define жалған нөл

#define анықта typedef
#define тұрақты const
#define статик static
#define таңбалы signed
#define таңбасыз unsigned
#define ұзын long
#define ұзыыын long long
#define бүтін int
#define нақты float
#define дәл double
#define таңба char
#define қуыс void
анықта таңба* жол;

#define ЖИЫМ(жиым, сан) жиым[сан]
#define көлем sizeof
#define құрылым struct
#define оның ->

#define сұрыпта qsort
#define абс abs

#define АРАЛЫҚ(і, а, б) үшін(бүтін і тең а; і кіші б; і арттыр)
#define КЕРІАРАЛЫҚ(і, а, б) үшін(бүтін і тең а - 1; і үтең б; і азайт)

#define КІШІСІ(а, б) ((а) кіші (б) ? (а) : (б))
#define ҮЛКЕНІ(а, б) ((а) үлкен (б) ? (а) : (б))

#define римландыр intToRoman
жол римландыр(бүтін сан) аш
	статик таңба ЖИЫМ(рим, 16) тең аш нөл жап;
	бүтін і тең нөл;

	егер (сан үтең мың)
		ЖИЫМ(рим, і арттыр) тең жетпіс+жеті; // М
	егер (сан үтең екі*мың)
		ЖИЫМ(рим, і арттыр) тең жетпіс+жеті;
	егер (сан үтең үш*мың)
		ЖИЫМ(рим, і арттыр) тең жетпіс+жеті;
	
	сан тең сан қалдық мың;

	егер (сан үтең бес*жүз) аш
		егер (сан үтең тоғыз*жүз) аш
			ЖИЫМ(рим, і арттыр) тең алпыс+жеті; // С
			ЖИЫМ(рим, і арттыр) тең жетпіс+жеті;
		жап
		әйтпесе аш
			ЖИЫМ(рим, і арттыр) тең алпыс+сегіз; // Д
			егер (сан үтең алты*жүз)
				ЖИЫМ(рим, і арттыр) тең алпыс+жеті; // С
			егер (сан үтең жеті*жүз)
				ЖИЫМ(рим, і арттыр) тең алпыс+жеті; // С
			егер (сан үтең сегіз*жүз)
				ЖИЫМ(рим, і арттыр) тең алпыс+жеті; // С
		жап
	жап

	әйтпесе егер (сан үтең жүз) аш
		егер (сан үтең төрт*жүз) аш
			ЖИЫМ(рим, і арттыр) тең алпыс+жеті; // С
			ЖИЫМ(рим, і арттыр) тең алпыс+сегіз; // Д
		жап
		әйтпесе аш
			ЖИЫМ(рим, і арттыр) тең алпыс+жеті; // С
			егер (сан үтең екі*жүз)
				ЖИЫМ(рим, і арттыр) тең алпыс+жеті; // С
			егер (сан үтең үш*жүз)
				ЖИЫМ(рим, і арттыр) тең алпыс+жеті; // С
		жап
	жап

	сан тең сан қалдық жүз;

	егер (сан үтең елу) аш
		егер (сан үтең тоқсан) аш
			ЖИЫМ(рим, і арттыр) тең сексен+сегіз; // Х
			ЖИЫМ(рим, і арттыр) тең алпыс+жеті; // С
		жап
		әйтпесе аш
			ЖИЫМ(рим, і арттыр) тең жетпіс+алты; // Л
			егер (сан үтең алпыс)
				ЖИЫМ(рим, і арттыр) тең сексен+сегіз; // Х
			егер (сан үтең жетпіс)
				ЖИЫМ(рим, і арттыр) тең сексен+сегіз; // Х
			егер (сан үтең сексен)
				ЖИЫМ(рим, і арттыр) тең сексен+сегіз; // Х
		жап
	жап

	әйтпесе егер (сан үтең он) аш
		егер (сан үтең қырық) аш
			ЖИЫМ(рим, і арттыр) тең сексен+сегіз; // Х
			ЖИЫМ(рим, і арттыр) тең жетпіс+алты; // Л
		жап
		әйтпесе аш
			ЖИЫМ(рим, і арттыр) тең сексен+сегіз; // Х
			егер (сан үтең жиырма)
				ЖИЫМ(рим, і арттыр) тең сексен+сегіз; // Х
			егер (сан үтең отыз)
				ЖИЫМ(рим, і арттыр) тең сексен+сегіз; // Х
		жап
	жап

	сан тең сан қалдық он;

	егер (сан үтең бес) аш
		егер (сан теңтең тоғыз) аш
			ЖИЫМ(рим, і арттыр) тең жетпіс+үш; // І
			ЖИЫМ(рим, і арттыр) тең сексен+сегіз; // Х
		жап
		әйтпесе аш
			ЖИЫМ(рим, і арттыр) тең сексен+алты; // В
			егер (сан үтең алты)
				ЖИЫМ(рим, і арттыр) тең жетпіс+үш; // І
			егер (сан үтең жеті)
				ЖИЫМ(рим, і арттыр) тең жетпіс+үш; // І
			егер (сан теңтең сегіз)
				ЖИЫМ(рим, і арттыр) тең жетпіс+үш; // І
		жап
	жап

	әйтпесе егер (сан үтең бір) аш
		егер (сан теңтең төрт) аш
			ЖИЫМ(рим, і арттыр) тең жетпіс+үш; // І
			ЖИЫМ(рим, і арттыр) тең сексен+алты; // В
		жап
		әйтпесе аш
			ЖИЫМ(рим, і арттыр) тең жетпіс+үш; // І
			егер (сан үтең екі)
				ЖИЫМ(рим, і арттыр) тең жетпіс+үш; // І
			егер (сан теңтең үш)
				ЖИЫМ(рим, і арттыр) тең жетпіс+үш; // І
		жап
	жап
	ЖИЫМ(рим, і) тең нөл;

	қайт рим;
жап

бүтін басты () аш
	бүтін сан;
	оқы(ондықПішім, жә сан);
	жаз(жолПішім жаңажол, римландыр(сан));
жап
